app/views/trips/edit.html.erb

    <%= form.label :member_ids, "Who is coming on this trip?" %><br>
    <%= form.collection_check_boxes :member_ids, User.all, :id, :name do |b| %>
---
SELECT "users".* FROM "users"