app/views/trips/index.html.erb


        <tbody>
            <% @trips.each do |trip| %>
                <tr>
                    <td><%= trip.trip_name %></td>
                    <td><%= trip.start_date %></td>
                    <td><%= trip.end_date %></td>
                    <td>
                        <% if trip.users.size <= 3 %>
                            <%= trip.users.map { |user| user.username }.join(", ") %>
                        <% else %>
                            <%= trip.users.first(3).map { |user| user.username }.join(", ") %> . . .
                        <% end %>
                    </td>
                    <td><%= link_to "Select", trip_path(trip.id) %></td>
                </tr>
            <% end %>
        </tbody>
    </table>
<% else %>
    <h3>You have no trips planned. Create one to get started.</h3>
    <h3>:)</h3>
---
SELECT "trips".* FROM "trips" INNER JOIN "participants" ON "trips"."id" = "participants"."trip_id" WHERE "participants"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."trip_id" = ?  [["trip_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."trip_id" = ?  [["trip_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "trip_memberships" ON "users"."id" = "trip_memberships"."user_id" WHERE "trip_memberships"."trip_id" = ?  [["trip_id", 1]]