app/views/trips/new.html.erb

    <div class="trip-users-list">
        <%= form.collection_check_boxes :user_ids, User.all, :id, :username do |user_box| %>
---
SELECT "users".* FROM "users"