app/models/concerns/trip_calculations.rb

  def total_owed_by(user)
    ExpenseSplit.joins(:expense)
                .where(expenses: { trip_id: id }, user_id: user.id)
                .sum(:amount)
---
SELECT SUM("expense_splits"."amount") FROM "expense_splits" INNER JOIN "expenses" ON "expenses"."id" = "expense_splits"."expense_id" WHERE "expenses"."trip_id" = ? AND "expense_splits"."user_id" = ?  [["trip_id", 2], ["user_id", 1]]