app/views/admin/dashboard.html.erb

            <td><%= trip.end_date %></td>
            <td><%= trip.users.map { |u| u.name || u.username }.join(", ") %></td>
---
SELECT "users".* FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."trip_id" = ?  [["trip_id", 3]]