app/controllers/admin_controller.rb

  def dashboard
    @trips = Trip.all.order(created_at: :desc)
---
SELECT "trips".* FROM "trips" ORDER BY "trips"."created_at" DESC