app/controllers/expenses_controller.rb

  def create
    split_ids = Array(params.dig(:expense, :split_user_ids)).map(&:to_i).reject(&:zero?)
    split_ids = @trip.users.pluck(:id) if split_ids.empty?
    @expense = @trip.expenses.build(expense_params)

    if @expense.save
---
INSERT INTO "expenses" ("description", "amount", "date", "category", "trip_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def set_trip
    @trip = current_user.trips.find_by_id(params[:trip_id])
---
SELECT "trips".* FROM "trips" INNER JOIN "participants" ON "trips"."id" = "participants"."trip_id" WHERE "participants"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]