app/controllers/settlements_controller.rb

SELECT "trips".* FROM "trips" INNER JOIN "participants" ON "trips"."id" = "participants"."trip_id" WHERE "participants"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."trip_id" = ?  [["trip_id", 2]]
---
  def show
    @trip = current_user.trips.find_by_id(params[:trip_id])
    unless @trip
      flash[:alert] = "Trip not found."
      redirect_to trips_path and return
    end
    @balances    = @trip.users.map { |u| [ u, @trip.net_balance(u) ] }