app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" INNER JOIN "participants" ON "trips"."id" = "participants"."trip_id" WHERE "participants"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 4], ["id", 3], ["LIMIT", 1]]
---
  def set_trip
    @trip = current_user.trips.find_by_id(params[:id])