app/controllers/trips_controller.rb

  def show
    @expenses   = @trip.expenses.order(date: :desc)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."trip_id" = ? ORDER BY "expenses"."date" DESC  [["trip_id", 2]]

  def create
    @trip = Trip.new(trip_params)
    @trip.user_id = current_user.id

    if @trip.save
      @trip.trip_memberships.create!(user_id: current_user.id)

      participant_ids = params[:trip][:participant_ids].to_a.map(&:to_i).reject(&:zero?)
      participant_ids.each do |uid|
        @trip.trip_memberships.find_or_create_by!(user_id: uid)
---
INSERT INTO "trips" ("trip_name", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["trip_name", "Hello"], ["start_date", "2026-04-19"], ["end_date", "2026-04-26"], ["created_at", "2026-04-19 22:59:51.215290"], ["updated_at", "2026-04-19 22:59:51.215290"]]
INSERT INTO "trip_memberships" ("trip_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["trip_id", 1], ["user_id", 1], ["created_at", "2026-04-19 21:32:09.604914"], ["updated_at", "2026-04-19 21:32:09.604914"]]
SELECT "users".* FROM "users" INNER JOIN "trip_memberships" ON "users"."id" = "trip_memberships"."user_id" WHERE "trip_memberships"."trip_id" = ?  [["trip_id", 2]]

  def update
    if @trip.update(trip_params)
      existing_ids = @trip.trip_memberships.pluck(:user_id)
      new_ids = params[:trip][:participant_ids].to_a.map(&:to_i).reject(&:zero?)
      new_ids << current_user.id

      (existing_ids - new_ids).each { |uid| @trip.trip_memberships.find_by(user_id: uid)&.destroy }
      (new_ids - existing_ids).each { |uid| @trip.trip_memberships.find_or_create_by!(user_id: uid) }
---
UPDATE "trips" SET "end_date" = ?, "updated_at" = ? WHERE "trips"."id" = ?  [["end_date", "2026-04-26"], ["updated_at", "2026-04-19 21:31:45.393081"], ["id", 2]]
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 1]]
INSERT INTO "trip_memberships" ("trip_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["trip_id", 1], ["user_id", 1], ["created_at", "2026-04-19 21:32:09.604914"], ["updated_at", "2026-04-19 21:32:09.604914"]]
SELECT "trips".* FROM "trips" INNER JOIN "participants" ON "trips"."id" = "participants"."trip_id" WHERE "participants"."user_id" = ? AND "trips"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def destroy
    @trip.destroy
---
DELETE FROM "trips" WHERE "trips"."id" = ?  [["id", 1]]