app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "phone", "title", "password_digest", "admin", "bio") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2026-04-19 21:41:05.338646"], ["password_digest", "[FILTERED]"], ["id", 1]]
---
  def update_password
    @user = current_user
    if @user.authenticate(params[:user][:password])
      @user.update(password: params[:user][:new_password])

UPDATE "users" SET "updated_at" = ?, "password_digest" = ?, "bio" = ? WHERE "users"."id" = ?  [["updated_at", "2026-04-19 21:37:24.951367"], ["password_digest", "[FILTERED]"], ["bio", "Hello :)"], ["id", 1]]
---
  def update_profile
    @user = current_user
    # use permitted params so updates actually apply
    if @user.authenticate(params[:user][:password])
      @user.update(user_params)