app/controllers/users_controller.rb

  def create
   @user=User.new(user_params)
   if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "phone", "title", "password_digest", "admin", "bio") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    #@user=set_user
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "password_digest" = ?, "bio" = ? WHERE "users"."id" = ?  [["updated_at", "2026-04-19 21:37:24.951367"], ["password_digest", "[FILTERED]"], ["bio", "Hello :)"], ["id", 1]]