app/models/expense.rb

  def split_evenly_among(user_ids)
    expense_splits.destroy_all
    share = (amount / user_ids.size).round(2)
    remainder = (amount - share * user_ids.size).round(2)

    user_ids.each_with_index do |uid, idx|
      adjusted = idx == 0 ? share + remainder : share
      expense_splits.create!(user_id: uid, amount: adjusted)
---
INSERT INTO "expense_splits" ("expense_id", "user_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["expense_id", 1], ["user_id", 1], ["amount", 16.66], ["created_at", "2026-04-19 23:08:13.018685"], ["updated_at", "2026-04-19 23:08:13.018685"]]