app/views/expenses/new.html.erb

SELECT "users".* FROM "users" INNER JOIN "participants" ON "users"."id" = "participants"."user_id" WHERE "participants"."trip_id" = ?  [["trip_id", 2]]
---
  <%= form.label :user_id, "Paid by" %>
  <%= form.select :user_id, @trip.users.map { |u| [u.name, u.id] }, {}, required: true %>